База_Back/src/AccumulationRegisters/отусБалансВиртуальныхКарт/отусБалансВиртуальныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>отусБалансВиртуальныхКарт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Карта</name>
    <type>
      <types>CatalogRef.отусВиртуальныеКарты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

База_Back/src/CommonModules/отусБонуснаяСистемаСервер/Module.bsl
Процедура СписатьПросроченныеБонусы() Экспорт

	ДнейЖизни = Константы.отусКоличествоДнейЖизниБонусов.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	отусБалансВиртуальныхКарт.Период КАК Период,
		|	отусБалансВиртуальныхКарт.Регистратор КАК Регистратор,
		|	отусБалансВиртуальныхКарт.Карта КАК Карта,
		|	отусБалансВиртуальныхКарт.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.отусБалансВиртуальныхКарт КАК отусБалансВиртуальныхКарт
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(отусБалансВиртуальныхКарт.Период, ДЕНЬ, &ДнейЖизни) < &Дата";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДнейЖизни", ДнейЖизни);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда 
				
		Выборка = РезультатЗапроса.Выбрать();
		
		мКарты = Новый Массив;

		Пока Выборка.Следующий() Цикл
		
			ДанныеКарты = Новый Структура;
			ДанныеКарты.Вставить("Карта", Выборка.Карта);
			ДанныеКарты.Вставить("Сумма", Выборка.Сумма);
			
			мКарты.Добавить(ДанныеКарты);
		
		КонецЦикла; 
		
		Документы.ОтусСписаниеБонусов.СоздатьДокументСписания(мКарты);
		
	КонецЕсли;	
	
	
КонецПроцедуры
